      ******************************************************************
      * Author:                            IGOR CRISPIM
      * Date:                              12/06/2025
      * Purpose:                           DECIDIR APROVAÇÃO DE ALUNOS
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID.                         AULA4.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM                         AULA4.
